Revit 2027 API
IFCAnyHandle.IsTypeOf Method
 Determines whether the instance is an instance of exactly the specified instance type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTypeOf(
	string typeName
)
Public Function IsTypeOf (
	typeName As String
) As Boolean
public:
bool IsTypeOf(
	String^ typeName
)
member IsTypeOf :
        typeName : string -> bool
Parameters
typeName String
 The instance type name.
Return Value
Boolean
 True if the instance is an instance of the specified instance type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace